Tekla.Structures.ModelInternal.Dstv.DstvMark
The dstv contour marking block information.

Tekla.Structures.ModelInternal.Dstv.DstvMark.#ctor
Creates a new DstvMark instance.

Tekla.Structures.ModelInternal.Dstv.DstvMark.MarkType
The contour marking type.

Tekla.Structures.ModelInternal.Dstv.DstvMark.MarkRows
The list with contour marking points.

Tekla.Structures.ModelInternal.Dstv.DstvMark.HardStamp
The hardstamp information for the connecting part.